#include "dialogueMaker/dialogueMaker.h"
#include <fstream>
#include <iostream>
#include <string>
#include <map>

void importDataFromFile(std::string filename, std::map<std::string, std::pair<std::string, bool>> &dialogueMap) {
    std::ifstream data(filename);
    std::string line;
    while (getline(data, line)) {
        size_t colon_pos = line.find(':');
        if (colon_pos != std::string::npos) {
            std::string id = line.substr(0, colon_pos);
            std::string dialogue = line.substr(colon_pos + 1);
            bool isEndScene = false;
            size_t ending_pos = dialogue.find(":true");
            if (ending_pos != std::string::npos) {
                dialogue = dialogue.substr(0, ending_pos);
                isEndScene = true;
            }
            dialogueMap[id] = std::make_pair(dialogue, isEndScene);
        }
    }
}

int main() {

    std::string filename = "dialogue.txt";
    std::map<std::string, std::pair<std::string, bool>> dialogueMap;
    importDataFromFile(filename, dialogueMap);
    for (const auto &pair : dialogueMap) {
          Game::addScene(pair.first, pair.second.first, pair.second.second);
    }
  Game::addEvent("18-3(1)", "18-3wizard_event(1)");
  Game::addEvent("18-3(2)", "18-3wizard_event(2)");
  Game::addEvent("18-3(3)", "18-3wizard_event(3)");
  Game::addEvent("18-3(4)", "18-3wizard_event(4)");
//↓ ↓ ↓ O P T I O N      Z O N E      S T A R T          H E R E ↓ ↓ ↓
//↓ ↓ ↓ JAME'S CODE
  Game::addOption("begin", {
    {"พิมพ์เลข 1 เพื่อเริ่มเกม", "prologue"}
  });

  Game::addOption("prologue", { 
    {"พิมพ์เลข 1 เพื่อดำเนินเรื่อง", "1-1"}
  });

  Game::addOption("1-1", {
    {"แตะที่โบราณวัตถุ", "2-1(1)"},
    {"สังเกตอย่างละเอียดอย่างเดียว", "2-2"}
  });

  Game::addOption("2-1(1)", {
    {"ยอมรับคำทำนาย", "3-1"}, 
    {"ปฏิเสธคำทำนาย", "3-2(1)"}
  });

  Game::addOption("2-1(2)", {
    {"ยอมรับคำทำนาย", "3-1"}, 
    {"ปฏิเสธคำทำนาย", "3-2(1)"}
  });

  Game::addOption("2-2", {
    {"เผชิญหน้ากับ วิญญาณ", "2-1(2)"}, 
    {"ต่อรองกับวิญญาณ", "3-2(2)"}
  });

  Game::addOption("3-1",{
    {"ดื่มน้ำจากทะเลสาบ","4-1"},
    {"เดินสำรวจรอบบริเวณทะเลสาบ","4-2"}
  });

  Game::addOption("3-2(1)",{
    {"เดินสำรวจลึกเข้าไปในป่า","4-2"},
    {"ถอย และทบทวนว่าจะเอาอย่างไรต่อ","4-3"}
  });

  Game::addOption("3-2(2)",{
    {"เดินสำรวจลึกเข้าไปในป่า","4-2"},
    {"ถอย และทบทวนว่าจะเอาอย่างไรต่อ","4-3"}
  });

  Game::addOption("4-1", {
    {"นั่งทำความเข้าใจเกี่ยวกับพลังที่เพิ่มขึ้นมา", "5-1"},
    {"เดินสำรวจบริเวณรอบทะเลสาบ", "4-1"}
  });

  Game::addOption("4-2", {
    {"สำรวจเมืองที่สาบสูญ", "5-2"},
    {"ออกจากเมือง", "6-4"}
  });

  Game::addOption("4-3", {
    {"หลบหนี", "4-2"},
    {"ต่อสู้กับมัน", "5-3"}
  });

  Game::addOption("5-1", {
    {"ไม่ใช้", "6-1"},
    {"ใข้", "6-2"}
  });

  Game::addOption("5-2", {
    {"ทำลาย", "6-2"},
    {"บูชา", "6-3"}
  });

  Game::addOption("5-3", {
    {"เดินหาเมือง", "4-2"},
    {"เดินเข้าไปในป่าต่อ", "6-4"}
  });

  Game::addOption("6-1", {
    {"ตามนกไป", "7-1(1)"},
    {"เดินตามใจอยาก", "7-2"}
  });

  Game::addOption("6-2", {
    {"สำรวจ", "7-1(2)"},
    {"ออกจากวัด", "7-2"}
  });

  Game::addOption("6-3", {
    {"สำรวจต่อ", "7-2"},
    {"ออกจากที่นี่", "6-4"}
  });

  //↓↓↓↓↓↓↓พ่อมดTrigger HERE
  Game::addOption("6-4", {
    {"เจรจา", "7-3", "18-3wizard_event(1)"},
    {"ต่อสู้", "ending_you_die"}
  });
  //↑↑↑↑↑↑↑พ่อมดHERE

  Game::addOption("7-1(1)", {
    {"ดูดซับมันเข้ามา", "8-1(1)"},
    {"สำรวจต่อ", "8-2"}
  });

  Game::addOption("7-1(2)", {
    {"ดูดซับมันเข้ามา", "8-1(1)"},
    {"สำรวจต่อ", "8-2"}
  });

  Game::addOption("7-2", {
    {"เดินไปข้างหน้า", "8-2"},
    {"เดินไปตามสัญชาติญาณ", "8-3"}
  });

  Game::addOption("7-3", {
    {"เดินสำรวจต่อ", "8-2"},
    {"หาที่พักสักแป๊บ", "8-3"}
  });

  Game::addOption("8-1(1)", {
    {"เดินตามนก", "9-1(1)"},
    {"เดินไปตามทาง", "10-2"}
  });

  Game::addOption("8-1(2)", {
    {"เดินตามนก", "9-1(1)"},
    {"เดินไปตามทาง", "10-2"}
  });

  Game::addOption("8-2", {
    {"ต่อสู้", "8-1(2)"},
    {"หลบหนี", "9-2"}
  });

  Game::addOption("8-3", {
    {"ไม่ซื้อ", "9-3"},
    {"ซื้อ", "9-4"}
  });

  Game::addOption("9-1(1)", {
    {"เดินเข้าเมือง", "10-1"},
    {"ไม่เข้าเมืองและไปในป่าอีกด้านหนึ่ง", "10-3"}
  });

  Game::addOption("9-1(2)", {
    {"เดินเข้าเมือง", "10-1"},
    {"ไม่เข้าเมืองและไปในป่าอีกด้านหนึ่ง", "10-3"}
  });

  Game::addOption("9-2", {
    {"ซ้าย", "9-1(2)"},
    {"ขวา", "10-2"}
  });

  Game::addOption("9-3", {
    {"ใช้มัน", "10-1"},
    {"ไม่ใช้", "10-2"}
  });

  Game::addOption("9-4", {
    {"ได้", "10-3"},
    {"ไม่ได้", "10-4"}
  });

  Game::addOption("10-1", {
    {"ไม่เข้าไปในหอสมุดและเดินสำรวจเมืองต่อ", "11-1(2)"},
    {"เข้าไปในหอสมุด", "11-2"}
  });

  Game::addOption("10-2", {
    {"เล่าข่าวช่วงนี้ให้ฟังที", "11-1(1)"},
    {"มอนสเตอร์ในป่าแถวนี้", "11-3(1)"}
  });

  Game::addOption("10-3", {
    {"ปีศาจต้นไม้", "11-3(2)"},
    {"ไม่ยุ่งเสียจะดีกว่า", "11-4"}
  });

  Game::addOption("10-4", {
    {"รีบออกไปจากที่นี่", "11-4"},
    {"ดูดซับ", "12-6"}
  });

  Game::addOption("11-1(1)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(2)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(3)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-2", {
    {"ออกมาและเผาทำลาย", "11-1(3)"},
    {"เรียนรู้", "12-6"}
  });

  Game::addOption("11-3(1)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-3(2)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-4", {
    {"ช่วย", "12-4"},
    {"ไม่ช่วย", "12-5"}
  });

  Game::addOption("12-1", {
    {"ไปที่ป่าตะวันตก", "13-1"},
    {"แจ้งทหาร", "12-2"}
  });

  Game::addOption("12-2", {
    {"ออกไปนอกเมือง", "13-2"},
    {"ด่าทอ", "13-3(1)"}
  });

  Game::addOption("12-3(1)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-3(2)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-4", {
    {"มันลอยไปกับน้ำแล้ว", "13-4(1)"},
    {"ไม่เห็นเลย", "13-4(2)"}
  });

  Game::addOption("12-5", {
    {"เข้าเมือง", "13-3(2)"},
    {"เดินเข้าไปในป่าต่อ", "13-2"}
  });

  Game::addOption("12-6", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("13-1", {
    {"ปราบภูติผีและช่วยชาวบ้าน", "14-1"},
    {"มันไม่ใช่เรื่องของฉัน", "14-2"}
  });

  Game::addOption("13-2", {
    {"ใช่", "14-3"},
    {"ไม่", "14-2"}
  });

  Game::addOption("13-3(1)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2(1)"}
  });

  Game::addOption("13-3(2)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2(1)"}
  });

  Game::addOption("13-4(1)", {
    {"ช่วยเธอตามหาของ", "14-4(1)"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4(2)"}
  });

  Game::addOption("13-4(2)", {
    {"ช่วยเธอตามหาของ", "14-4(1)"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4(2)"}
  });
  
  Game::addOption("14-1", {
    {"พาชาวบ้านกลับเมือง", "15-1"},
    {"ปล่อยให้พวกเขาหาทางกลับเอง", "14-2"}
  });

  Game::addOption("14-2", {
    {"ได้", "15-2(2)"},
    {"ไม่ได้", "15-3"}
  });

  Game::addOption("14-3", {
    {"ตอบความจริง", "15-2(3)"},
    {"โกหก", "15-3"}
  });

  Game::addOption("14-4(1)", {
    {"เข้าไป", "14-3"},
    {"อย่าไปยุ่งดีกว่า", "14-2"}
  });

  Game::addOption("14-4(2)", {
    {"เข้าไป", "14-3"},
    {"อย่าไปยุ่งดีกว่า", "14-2"}
  });

  Game::addOption("14-5", {
    {"มี", "15-4"},
    {"ไม่มี", "ending_execution"}
  });

  Game::addOption("15-1", {
    {"ยอมรับ", "16-1"},
    {"ปฏิเสธ", "16-2(1)"}
  });

  Game::addOption("15-2(1)", {
    {"ไปที่เมืองอีกแห่ง", "16-3"},
    {"ผจญภัยต่อ!", "17-2"}
  });

  Game::addOption("15-2(2)", {
    {"ไปที่เมืองอีกแห่ง", "16-3"},
    {"ผจญภัยต่อ!", "17-2"}
  });

  Game::addOption("15-2(3)", {
    {"ไปที่เมืองอีกแห่ง", "16-3"},
    {"ผจญภัยต่อ!", "17-2"}
  });

  Game::addOption("15-3", {
    {"เดินขึ้นไปบนเขา", "16-2(2)"},
    {"เดินหาเมืองอีกเมือง", "16-3"}
  });

  Game::addOption("15-4", {
    {"ตามหาพ่อมดมืด", "18-3(1)"},
    {"ทำไมผมต้องทำตาม", "16-3"}
  });

  Game::addOption("16-1", {
    {"รับยศ+บรรดาศักดิ๋", "17-1"},
    {"ออกจากเมือง", "17-2"}
  });

  Game::addOption("16-2(1)", {
    {"เดินไปทางที่สัตว์จากมา", "17-2"},
    {"เดินตามสัตว์ไป", "18-3(3)"}
  });

  Game::addOption("16-2(2)", {
    {"เดินไปทางที่สัตว์จากมา", "17-2"},
    {"เดินตามสัตว์ไป", "18-3(3)"}
  });

  Game::addOption("16-3", {
    {"ร่วมสู้กับชาวเมือง", "19-2(1)"},
    {"ตามหาตัวการ(พ่อมดมืด)", "18-3(2)"}
  });

  Game::addOption("17-1", {
    {"โบสถ์ศักดิ์สิทธิ์", "18-1"},
    {"เข้าไปในป่าต้องห้าม", "17-2"}
  });

  Game::addOption("17-2", {
    {"ต่อสู้", "18-2"},
    {"หลบหนี", "18-3(4)"}
  });

  Game::addOption("18-1", {
    {"รับคำขอ", "19-1"},
    {"ปฏิเสธ", "19-2(3)"}
  });

  Game::addOption("18-2", {
    {"สำรวจต่อ", "18-1"},
    {"ออกจากที่นี่", "19-2(2)"}
  });

// W I Z A R D
  Game::addOption("18-3(1)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

  Game::addOption("18-3(2)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

  Game::addOption("18-3(3)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

  Game::addOption("18-3(4)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

    Game::addOption("18-3wizard_event(1)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

    Game::addOption("18-3wizard_event(2)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

    Game::addOption("18-3wizard_event(3)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });

    Game::addOption("18-3wizard_event(4)", {
    {"ต่อสู้", "ending2"},
    {"ร่วมมือกับเขา", "ending3"}
  });
//W I Z A R D 

//Cut ending3 from 19-1???
  Game::addOption("19-1", {
    {"ยอมรับในโชคชะตา", "ending1"},
    {"เดินในทางของคุณ", "ending2"},
    {"ปล่อยให้ความมืดกลืนกินคุณ", "ending3"}
  });

  Game::addOption("19-2(1)", {
    {"กลับเข้าเมือง", "ending1"},
    {"ออกพเนจร", "ending2"}
  });

  Game::addOption("19-2(2)", {
    {"กลับเข้าเมือง", "ending1"},
    {"ออกพเนจร", "ending2"}
  });

  Game::addOption("19-2(3)", {
    {"กลับเข้าเมือง", "ending1"},
    {"ออกพเนจร", "ending2"}
  });
//end of option zone

  // Game loop
  Game::runGame("begin");
}
