#include "dialogueMaker/dialogueMaker.h"

int main() {
/* Create scenes
  Game::addScene("", "");
*/
  Game::addScene("begin", "XD LOLอะไรว่ะคุณเดินผ่านซุ้มประตูใหญ่เข้ามาในเมือง เพียงคุณเดินเข้ามาก็มีหลากหลายสายตาจับจ้อง แต่การมาถึงของนักเดินทางรวมถึงนักผจญภัยในเมืองนี้ไม่ค่อยเป็นอันตรายสักเท่าไหร่ เพราะนักเดินทางส่วนใหญ่ล้วนมาที่เมืองแห่งนี้เพื่อแลกเปลี่ยนสินค้า เดินไปกลางเมืองใหญ่คุณพบกับที่ที่หนึ่งถูกล้อมปิดไว้ไม่ให้ใครเข้า มันเป็นสถานที่เก็บหนังสือ แต่ยิ่งห้ามก็เหมือนยิ่งยุจึงมีคนหลายคนพยายามที่จะแหกกฏเข้าไป ด้วยความสงสัยคุณเลยถามผู้คนแถวนั้นได้ความว่าที่แห่งนี้เป็นหอสมุดต้องห้าม คุณเดินออกมาจากฝูงชนแถวนั้นและจากนั้นคุณเลือกที่จะ");
  Game::addScene("4-1", "หลังตากที่คุณได้ยืนดูทะเลสาบที่มีน้ำใสกริ้งอยู่พักใหญ่ๆ คุณก็ได้ตัดสินใจเดินเข้าไปบริเวณฝั่งและใช้มือทั้ง 2 ข้างของคุณช้อนน้ำขึ้นมา แล้วดื่มเข้าไป หลังจากคุณดื่มน้ำเข้าไป จู่ๆคุณก็รู้สึกแปลกๆ คล้ายกับพลังงานที่หมุนเวียนอยู่ภายในร่างกายของคุณนั้นแปลกไป หลักจากสักพักใหญ่ๆคุณก็รู้สึกได้ว่า ‘พลังของคุณแข็งแกร่งขึ้น!’ นอกจากนี้แล้วร่างกายของคุณยังเบาหวิว แถมยังขยับตัวได้คล่องกว่าก่อนหน้านี้เสียอีก");
  Game::addScene("4-2", "ขณะที่คุณเดินผ่านต้นไม้น้อยใหญ่ไปสักพัก คุณก็เห็นซากของสิ่งปลูกสร้างบางอย่างปรากฏอยู่ด้านหน้าของคุณ จำนวนของสิ่งปลูกสร้างนั้นมากมายจนไม่อาจนับได้เลยว่ามีมากเท่าไหร่ แต่สิ่งที่คุณสามารถสรุปได้นั้นคือ ครั้งหนึ่งในอดีตมันต้องเคยเป็นเมืองมาก่อนแน่ๆ แต่คุณก็ต้องมุ่นคิ้วเนื่องจากคุณไม่เห็นสัญญาณ​ของสิ่งมีชีวิตอยู่เลย เสมือนว่าที่นี่ถูกปล่อยให้รกร้างมานานมากแล้ว");
  Game::addScene("4-3", "ในขณะที่คุณกำลังคิดว่าจะเอาอย่างไรต่อดีนั้น เสียงดังโครมครามของบางสิ่งบางอย่างกำลังใกล้เข้ามาหาคุณ ลักษณะท่าทางคล้ายสัตว์แต่รูปลักษณ์ของมันนั้นน่าสยดสยองเกินบรรยาย เมื่อคุณสังเกตเห็นมัน เจ้าสัตว์ประหลาดตัวนั้นก็พุ่งตรงมาทางคุณทันที !");
  Game::addScene("5-1", "คุณกำลังคิดว่าจะเริ่มจากตรงไหนดี เกี่ยวกับพลังที่เพิ่มมากขึ้นในตัวคุณ คุณลองเริ่มตั้งสมาธิเพื่อให้พลังงานออกมา จู่ๆ ก็มีกระต่ายป่าตัวหนึ่งคาบสิ่งๆหนึ่งมาให้คุณ คุณพบว่ามันคือคัมภีร์อะไรบางอย่าง คุณต้องตัดสินใจว่าจะใช้หรือไม่ใช้มันดี");
  Game::addScene("5-2", "หลังจากที่คุณได้ผ่านเข้าไปในประตูเมืองแล้ว คุณได้สังเกตพบว่าบริเวณใจกลางของเมืองนี้มีบ้านหลังใหญ่อยู่หลังหนึ่ง ซึ่งคุณเดาว่ามันคงจะเป็นบ้านของผู้ที่เคยปกครองเมืองแห่งนี้ และเมื่อคุณกวาดสายตาไปโดยรอบแล้วก็เห็นบ้านน้อยใหญ่ตามพื้นที่ หลังจากสังเกตอยู่นาน คุณได้ตัดสินใจเดินเข้าไปที่บ้านหลังใหญ่ซึ่งอยู่บริเวณกลางเมือง ภายในนั้นคุณได้พบเข้ากับจี้อันหนึ่งซึ่งวางอยู่บนโต๊ะไม้เก่าๆ ถึงแม้ว่าจี้นี้จะดูเก่าแก่แต่มันกลับส่งกลิ่นอายของมนต์ดำออกมา");
  Game::addScene("5-3", "การปะทะกันระหว่างคุณกับสัตว์ประหลาดนั้นได้เริ่มขึ้น เพียงแค่มันเริ่มโจมตีคุณ คุณนั้นก็สามารถรับรู้ได้เลยว่า คุณไม่สามารถต่อกรกับมันได้ เจ้านี่มีพลังเยอะเกินกว่าที่คุณจะรับมือไหว ทำให้คุณบาดเจ็บสาหัส เนื่องจากคุณมีพลังไม่มากพอ ที่จะสามารถต่อกรกับมันได้");
  Game::addScene("6-1", "คุณเริ่มออกเดินทางต่อ เดินออกจากทะเลสาบมาสักพัก รอบตัวคุณก็มีแต่ต้นไม้สูงใหญ่ที่เขียวขจี หญ้าสูงระดับหัวเข่า เดินไปไม่นานคุณมีความรู้สึกว่าเริ่มเหนื่อย เลยคิดว่า ‘หากแถวนี้มีเมืองสักเมืองให้นั่งพักก็คงจะดี’ คิดอะไรเรื่อยเปื่อยไปสักพัก คุณก็สังเกตเห็นนกฝูงหนึ่งกำลังบินไปยังทิศเหนือของป่าใหญ่");
  Game::addScene("6-2", "อยู่ๆคุณก็รู้สึกว่าภาพด้านหน้าของคุณได้ตัดไป เมื่อคุณตื่นมาอีกครั้ง คุณได้พบว่าคุณกำลังอยู่ในสถานที่แห่งใหม่ ดูลักษณะภายนอกนั้นเหมือนจะเป็นวัดที่ตั้งอยู่ตรงตีนเขา วัดแห่งนี้ถูกล้อมรอบไปด้วยภูเขาสูงสลับกันไปมาอย่างสวยงาม แต่รอบๆบริเวณนี้ดูเหมือนจะมีกับดักอยู่มากมายเลยนะ คุณกวาดสายตามองอย่างครุ่นคิด");
  Game::addScene("6-3", "คุณจ้องมองไปที่จี้อันนั้น พร้อมกับหันมองไปรอบๆว่าแท้จริงแล้วนี่มันคือกับดักหรือไม่ แต่เมื่อคุณสำรวจก็ไม่พบอะไรที่แปลกประหลาด คุณจึงได้หยิบจี้นั้นขึ้นมาแล้วบูชามันเสีย พลังความมืดกำลังก่อกำเนิดเพิ่มขึ้นในตัวคุณอย่างมหาศาล นี่สินะรสชาติของพลัง คุณได้แต่คิดว่าจะทำยังไงต่อดีล่ะ");
  //↓↓↓↓↓↓↓พ่อมดHERE
  Game::addScene("6-4", "คุณเลือกที่จะเดินออกมาจากตรงนั้น แล้วไปสำรวจทางอื่นแทน ตอนแรกที่เริ่มเดินนั้นเต็มไปด้วยต้นไม้สูงใหญ่ เดินไปได้ไม่นานคุณได้พบกับลานกว้างแห่งหนึ่ง ซึ่งบริเวณใจกลางลานกว้างนั้นมีที่พำนักคล้ายกระท่อมอยู่ รอบๆกระท่อมมีพวกเครื่องไม้เครื่องมือรวมไปถึงสมุนไพรหน้าตาประหลาดอยู่ ในกระท่อมนั้นอาจจะมีคนอยู่อาศัยก็เป็นได้ แต่คุณคิดสงสัยได้ไม่นาน จู่ๆ ก็มีพ่อมดมืดปรากฏตัวอยู่ข้างหน้าของคุณ ! ");
  //↑↑↑↑↑↑↑พ่อมดHERE
  Game::addScene("7-1(1)", "คุณตัดสินใจเดินไปตามทางที่นกกำลังบินไป ท่ามกลางป่าใหญ่ทำให้คุณต้องเดินอย่างระมัดระวัง ซึ่งระหว่างทางนั้น คุณเกือบจะสะดุดรากไม้หลายครั้งหลายคราเลยทีเดียว สายตาของคุณไม่คลาดกับฝูงนกเลยสักวินาทีเดียว เหมือนมันอยากจะพาคุณไปที่ที่มันกำลังจะไปเช่นเดียวกัน สักพักใหญ่คุณก็เดินมาเจอกับถ้ำแห่งหนึ่ง คุณจึงเดินเข้าไปและทำให้คุณรู้สึกได้ถึงพลังงานภายในถ้ำ จากการสำรวจของคุณ คุณค้นพบว่าถ้ำแห่งนี้เป็นถ้ำศักดิ์สิทธิ์ที่เต็มไปด้วยไอพลังเวทย์");
  Game::addScene("7-1(2)", "คุณเดินสำรวจภายในบริเวณวัดนั้นไปเรื่อยๆ พลางสังเกตไปรอบๆ สักพักใหญ่คุณก็เดินไปใกล้ตีนเขาที่อยู่ด้านหลังของวัด มาเจอกับถ้ำแห่งหนึ่ง คุณจึงเดินเข้าไปและทำให้คุณรู้สึกได้ถึงพลังงานภายในถ้ำ จากการสำรวจของคุณ คุณค้นพบว่าถ้ำแห่งนี้เป็นถ้ำศักดิ์สิทธิ์ที่เต็มไปด้วยไอพลังเวทย์");
  Game::addScene("7-2", "คุณได้ย่ำเท้าไปตามทางลูกรังที่มีกรวดน้อยใหญ่และต้นหญ้าขึ้นแซมเป็นหย่อม ด้วยทางที่ไม่เรียบนักคุณได้เดินชมนกชมไม้ไปพลาง แต่สายตานั้นก็ไปหยุดอยู่ที่จุดๆหนึ่งเป็นพิเศษ คุณรู้สึกว่าที่บริเวณนั้นมีบางอย่างที่พิเศษแต่คุณก็ไม่รู้เช่นกันว่ามันคืออะไร บริเวณโดยรอบนั้นคุณเห็นได้อย่างชัดเจนว่ามันอึมครึมและให้ความรู้สึกลึกลับ");
  Game::addScene("7-3", "คุณเลือกที่จะเจรจากับพ่อมดตนนี้ คุณได้ทำการอ้อนวอนและขอให้เขาไม่ฆ่าคุณ พ่อมดอาจจะเห็นถึงความพยายามหรืออะไรก็แล้วแต่ เขาจึงปล่อยคุณไปและหายตัวไปอย่างรวดเร็ว โดยที่คุณไม่รู้เลยว่าคุณจะต้องตอบแทนเขาในอนาคตข้างหน้า คุณจึงเดินออกไปจากที่นี่ จากนั้นคุณเลือกที่จะ");
  Game::addScene("8-1(1)", "คุณได้ตั้งสมาธิและทำจิตใจให้สงบ ก่อนที่พลังในถ้ำจะดูเพิ่มมากขึ้นจนคุณรู้สึกได้ พลังงานบางอย่างกำลังมุ่งหน้าเข้ามาหาตัวคุณ คุณรู้สึกได้ว่ามันกำลังไหลเวียนอยู่ในร่างกายของคุณมากขึ้นเรื่อยๆ อย่างมหัศจรรย์ พอทุกอย่างดูเงียบสงบไปคุณเลยตัดสินใจเดินออกไปจากถ้ำ เมื่อคุณเดินออกมาเรื่อยๆ คุณได้เจอกับนกน้อยตัวหนึ่งเกาะบนกิ่งไม้ เมื่อคุณเข้าไปใกล้มัน มันก็ไม่บินหนี จนกระทั่งคุณกำลังจะจับมัน มันได้กระพือปีกบินขึ้นไปบนท้องฟ้า");
  Game::addScene("8-1(2)", "คุณต่อสู้กับเจ้าพวกสัตว์ประหลาดสำเร็จ และมีพลังงานบางอย่างกำลังไหลเวียนอยู่ในร่างกายของคุณมากขึ้นเรื่อยๆ อย่างมหัศจรรย์ เมื่อหลุดพ้นจากตรงนั้นได้ คุณก็เดินไปตามทางเรื่อยๆ และได้มาเจอกับนกน้อยตัวหนึ่งที่เกาะบนกิ่งไม้ เมื่อคุณเข้าไปใกล้มัน มันก็ไม่บินหนี จนกระทั่งคุณกำลังจะจับมัน มันได้กระพือปีกบินขึ้นไปบนท้องฟ้า");
  Game::addScene("8-2", "เดินไปชั่วครู่ คุณก็ได้ไปพบกับพื้นที่รกร้างแห่งหนึ่งที่เต็มไปด้วยหญ้าสูงเกือบเอว หนาแน่นจนแทบไม่มีที่ให้เดิน โดยที่คุณไม่ได้สังเกตเลยว่า ณ ที่แห่งนี้มีสัตว์ประหลาดมากมายซ่อนตัวอยู่ ด้วยความโชคดีของคุณ คุณยังไม่เดินไปเหยียบพวกมันสักตัว แต่แล้วเมื่อคุณเดินไปสักพัก หางตาของคุณก็เหลือบไปเห็นหางของเจ้าสัตว์ประหลาดตัวหนึ่ง");
  Game::addScene("8-3", "เมื่อคุณกำลังหยุดพักอยู่ใต้ต้นไม้ใหญ่ คุณสังเกตเห็นคนที่กำลังแบกสัมภาระขนาดใหญ่เดินมาทางนี้ 'เหมือนจะเป็นนักเดินทางพเนจร' คุณคิดไม่นานเขาก็เดินใกล้เข้ามาใกล้คุณเรื่อยๆ พร้อมกับยิ้มให้คุณอย่างสดใส เขาได้เล่าเส้นทางการเดินทางของเขาและเสนอขายของคุณภาพดีให้แก่คุณ");
  Game::addScene("9-1(1)", "ท่ามกลางต้นไม้นานาชนิด มันทำให้คุณเดินตามนกตัวน้อยไปอย่างจดจ่อว่าคุณจะสามารถไปตามเจ้านกตัวนั้นได้โดยไม่คลาดกันเสียก่อน จากต้นไม้รกตาตอนนี้คุณเหมือนเห็นแสงสว่างที่ปลายอุโมงค์ คุณได้เดินไปเรื่อยๆจุดสุดถึงปลายอุโมงค์ก็พบว่าตนได้มาปรากฏ​อยู่ที่หน้าประตูเมืองใหญ่เสียแล้ว");
  Game::addScene("9-1(2)", "ท่ามกลางท้องฟ้าที่มืดครึ้มและปกคลุมไปด้วยก้อนเมฆและต้นไม้ใหญ่ คุณได้เดินทอดน่องมาเรื่อยๆจนพบพบกับแม่น้ำสายหนึ่ง คุณได้เดินเลียบตามลำน้ำไปและพบกับสิ่งปลูกสร้างหนึ่งอยู่ที่ปลายสุดของเขตลำน้ำนี้ บริเวณนั้นเป็นเมืองๆหนึ่ง ซึ่งตอนนี้คุณได้มาหยุดอยู่ที่ประตูเมืองแล้ว แต่ในอีกด้านหนึ่งของเมืองนั้นก็มีป่าอยู่เช่นกัน");
  Game::addScene("9-2", "ตัวของคุณนั้นสั่นขึ้นมาโดยอัตโนมัติ สัญช่ติญาณของคุณได้บอกกับคุณว่า’อันตราย’ ด้วยทักษาการเอาตัวรอดของคุณ คุณพยายามหลบหลีกพวกมันอย่างคล่องแคล่ว และแล้วสักพักคุณก็สามารถหลุดออกมาจากป่าใหญ่ได้ คุณหอบหายใจอย่างหนักก่อนที่จะทรุดตัวลงนั่งอยู่ใต้ต้นไม้ใหญ่เพื่อพักเหนื่อย คุณจะไปทางไหนต่อ");
  Game::addScene("9-3", "คุณตัดสินใจที่จะไม่ซื้อของที่นักเดินทางเสนอให้คุณ คุณจึงได้ปลีกตัวออกมา เพราะไม่อยากจะยุ่งกับเขาอีก ไม่นานคุณก็เจอกับทางที่ดูเหมือนว่าผู้คนจะใช้ทางนี้ในการสัญจรกัน เพราะพื้นดินจากที่ควรจะเป็นหญ้าตอนนี้มันมีเพียงแต่ดินที่ดูเหมือนถูกล้อลากเข็นผ่านเป็นเวลานาน คุณเดินไปตามทางและสังเกตเห็นทหารหลายนาย ดูเหมือนว่ารถม้าที่พังอยู่ตรงนั้นน่าจะโดนปล้น คุณพยายามเดินเลาะบริเวณนั้นเพื่อไม่ให้ถูกจับได้ แต่ในขณะนั้นคุณพลันเหลือบไปเห็นบางอย่าง คุณได้เก็บมันมาถือไว้และ คุณตัดสินใจที่จะ");
  Game::addScene("9-4", "คุณตัดสินใจซื้อ แต่แล้วกลับพบว่ามันเป็นของปลอม ‘ไอ้นักเดินทางเฮงซวย!’ คุณสบถออกมาอย่างหัวเสีย แต่ช่วยอะไรไม่ได้ มันเดินออกไปตั้งนานแล้ว และก็เป็นความผิดของคุณเองที่ไม่ดูให้ดี คุณเดินคิดไปพลางเจอกับหมู่บ้านแห่งหนึ่ง เป็นหมู่บ้านเล็กๆ คุณได้ตัดสินใจเข้าไปใกล้ๆ แต่ไม่ทันจะได้เดินเข้าไป ดันเจอกับชาวบ้านเสียก่อน ก่อนที่เขาจะทำร้ายคุณ คุณตัดสินใจพูดออกไปว่า “ผมเป็นนักผจญภัย ผมมาดีไม่ได้คิดจะมาทำร้ายพวกคุณ” ก่อนที่ชาวบ้านคนนั้นจะบอกว่า'ภายในป่ามีสัตว์ป่ามากมายเหลือเกินเพียงคนในหมู่บ้านนั้นไม่พอที่จะสู้กับมัน คุณพอจะช่วยได้หรือไม่'");

  Game::addScene("10-1", "คุณเดินผ่านซุ้มประตูใหญ่เข้ามาในเมือง เพียงคุณเดินเข้ามาก็มีหลากหลายสายตาจับจ้อง แต่การมาถึงของนักเดินทางรวมถึงนักผจญภัยในเมืองนี้ไม่ค่อยเป็นอันตรายสักเท่าไหร่ เพราะนักเดินทางส่วนใหญ่ล้วนมาที่เมืองแห่งนี้เพื่อแลกเปลี่ยนสินค้า เดินไปกลางเมืองใหญ่คุณพบกับที่ที่หนึ่งถูกล้อมปิดไว้ไม่ให้ใครเข้า มันเป็นสถานที่เก็บหนังสือ แต่ยิ่งห้ามก็เหมือนยิ่งยุจึงมีคนหลายคนพยายามที่จะแหกกฏเข้าไป ด้วยความสงสัยคุณเลยถามผู้คนแถวนั้นได้ความว่าที่แห่งนี้เป็นหอสมุดต้องห้าม คุณเดินออกมาจากฝูงชนแถวนั้นและจากนั้นคุณเลือกที่จะ");
  Game::addScene("10-2", "เดินไปสักพักท้องฟ้าจากที่เคยสว่างนั้นเริ่มมืดลง เวลาตอนนี้กำลังคลืบืบคลานเข้าสู่ช่วงเย็น คุณจำเป็นต้องหาที่เพื่อพักผ่อนก่อนลุยต่อ ไม่นานคุณก็พบกับที่ที่คุณคิดว่าจะพักในคืนนี้ได้แล้ว มันเป็นทุ่งหญ้าขนาดใหญ่ไร้ซึ่งผู้คนมีแต่ความเงียบเหงา ในขณะที่คุณกำลังจะพักผ่อนนั้นได้มีนักเดินทางผ่านมาพร้อมทั้งกล่าวว่า “ขอผมพักที่นี่กับคุณด้วยได้ไหม” คุณตอบตกลง แล้วเขาได้โพล่งขึ้นมาว่า “ขอบใจมาก ถ้าอย่างนั้นคุณต้องการอะไรเป็นการตอบแทนหรือ");
  Game::addScene("10-3", "คุณเดินเลาะกำแพงเมืองออกมา มุ่งหน้าเดินไปในป่าใหญ่ ไม่นานคุณก็พบกับร่องรอยของสัตว์ป่าเป็นทางยาว คุณเลยตัดสินใจตามรอยนั้นไป และได้พบกับรอยคราบเลือด ที่เหมือนจะโดนลากไปบนต้นไม้ ‘คราบเลือดบนต้นไม้? ต้นไม้นี่แปลกจริงๆ’ คุณคิดอย่างสงสัย");
  Game::addScene("10-4", "คุณตัดสินใจทอดทิ้งพวกเขา และปฏิเสธที่จะให้ความช่วยเหลือกับพวกชาวบ้าน คุณเดินออกห่างจากหมู่บ้านนั้นได้ไม่นาน คุณก็รู้สึกได้ว่าพลังมืดแถวนี้รุนแรงมากจนคุณสัมผัสถึงมันได้ ระหว่างที่คุณเดินไปนั้น คุณได้แต่คิดไม่ตกว่าจะเอาอย่างไรต่อดี คุณจะทำอย่างไรต่อ");
  Game::addScene("11-1(1)", "เมืองใหญ่เมืองนึงไม่ไกลจากนี้มากนัก หลายวันมานี้มีข่าวการหายไปของคนในชุมชนเป็นว่าเล่น นับว่าเป็นข่าวใหญ่เลยก็ได้เพราะขนาดผมยังไม่ได้ไปที่เมืองแห่งนั้น ผมยังได้ยินข่าวนี้มาเป็นรอบที่ 2 ของวันเลยด้วย” เขาเล่าให้คุณฟังอย่างที่คุณขอ คุณคิดเกี่ยวกับเหตุการณ์ที่เกิดขึ้น");
  //↓↓↓↓↓↓↓รอแก้
  Game::addScene("11-1(2)", "คุณได้ตัดสินใจที่จะไม่เข้าไปในหอสมุดประหลาดนี้และเลือกที่จะเดินเข้าไปในตัวเมืองแทน ในขณะที่คุณกำลังเดินสำรวจภายในเมืองไปสักพักก็ไปเจอกับตลาด ที่ที่แลกเปลี่ยนขายของกันที่นี่ คุณเดินเข้าไปข้างในด้วยความที่อยากรู้ว่ามีอะไรน่าสนใจบ้าง เดินไปเดินมาคุณได้ยินพวกชาวบ้านยืนคุยกันว่า คนหลายคนในชุมชนนี้หายตัวไปอย่างปริศนา");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-1(3)", "คุณนำมันออกมาเผาในที่ลับตาผู้คน กว่าจะเผาหมดคุณใช้เวลานานพอสมควร จากนั้นคุณเดินกลับเข้าไปในเมือง และได้ยินพวกชาวบ้านยืนคุยกันว่า คนหลายคนในชุมชนนี้หายตัวไปอย่างปริศนา");
  Game::addScene("11-2", "ภายในที่แห่งนี้เต็มไปด้วยชั้นวางหนังสือที่เรียงกันทอดยาวไปสุดสายตา คุณเลือกที่จะเดินเข้าไปที่ซอกหนึ่งของชั้นหนังสือ และได้พบว่าเป็นหนังสือเกี่ยวกับมนต์ดำ คุณเดินสำรวจอีกหลายๆ ที่ของหอสมุด ก็ล้วนพบว่ามีแต่หนังสือที่เกี่ยวกับมนต์ดำเต็มไปหมด");
  Game::addScene("11-3(1)", "แถวนี้นั้นเต็มไปด้วยสัตว์ประหลาดมากมาย คุณอาจได้ยินเสียงพวกมันบ่อยๆ ดังออกมาจากป่าใหญ่ จากที่ผมเคยเจอและต่อสู้กับพวกมันบางตัว มันมีหลากหลายชนิดหลากหลายสายพันธุ์นับไม่ถ้วน และผมคาดว่าพวกมันอาจจะกระจายตัวทั่วทั้งป่าเลยล่ะ” เขาบอก รุ่งขึ้นคุณและเขาแยกทางกัน คุณเดินเข้าไปในป่าอีกที่นึง คุณเดินไปสักพักก็สังเกตเห็นต้นไม้ต้นนึง พลันสั่นไหวและมันหันมาที่คุณ ‘มันดูอันตราย’");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-3(2)", "ไม่นานคุณก็ได้ยินเสียงแปลกๆ มาจากต้นไม้ต้นนั้น คุณเลยเดินเข้าไปใกล้ขึ้นเรื่อยๆ จนคุณก็สังเกตเห็นว่าต้นไม้ต้นนั้นพลันสั่นไหวและมันหันมาที่คุณ ‘มันดูอันตราย’ คุณคิด");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-4", "คุณเดินออกมาจากตรงนั้นแล้วเดินไปทางอื่นต่อ สักพักท้องฟ้าก็เริ่มมืดครึ้ม ฝนกำลังตั้งเค้า ก้อนเมฆกลายเป็นสีเทาเหมือนฝนที่พร้อมจะตกตลอดเวลา ไม่นานฝนก็เริ่มตกหนัก คุณเดินไปหลบฝนใต้ต้นไม้ใกล้ๆ กับแม่น้ำ แต่เหมือนว่าฝนจะตกหนักจนแม่น้ำเชี่ยวกราก คุณกำลังจะเดินออกไปจากบริเวณนั้นแต่แล้วก็ได้ยินเสียงขอความช่วยเหลือดังมาจากในแม่น้ำ เหมือนว่าเธอคนนั้นจะพลัดตกลงไป");
  //↓↓↓↓↓↓↓ ต้ อ ง เ พิ่ ม
  Game::addScene("12-1", "คุณตัดสินใจที่จะสืบเรื่องราวนี้ต่อ จากการพบเจอชาวบ้านและผู้คนในบริเวณนี้นั้น ทำให้คุณรู้ข้อมูลว่าผู้คนมักจะหายไปในตอนกลางคืนทางด้านป่าตะวันตก");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-2", "คุณเลือกที่จะไปแจ้งทหารที่อยู่ในเมือง แต่คุณก็ต้องแปลกใจที่ทหารเหล่านั้นกลับทำเฉยกับเรื่องราวเหล่านี้ ราวกับว่าไม่มีอะไรเกิดขึ้น คุณรู้สึกหัวเสียเป็นอย่างมากเลยเลือกที่จะ");
  Game::addScene("12-3(1)", "คุณเดินเข้าไปเกือบถึงตัวมัน ต้นไม้นั่นเริ่มโจมตีคุณโดยไม่ทันได้ตั้งตัว คุณสวนกลับไปอย่างไม่มีใครยอมใคร ในสุดท้ายแล้วคุณก็สามารถจัดการกับต้นไม้ปีศาจนั่นได้ เมื่อคุณเดินไปเจอเหล่าชาวบ้านกลุ่มหนึ่งที่อาศัยอยู่บริเวณนี้ พวกเขาเหล่านั้นได้ทราบเรื่องก็ต่างดีใจกันมาก และอวยพรให้คุณพร้อมกับให้เงินกับคุณจำนวนหนึ่ง คุณขอบคุณพวกเขาและออกเดินทางต่อ");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-3(2)", "คุณเลือกที่จะหนีจากต้นไม้นั่นออกมา และไม่ต้องทิ้งชีวิตไว้ที่นี่ คุณเดินไปเรื่อยๆ ก็ไปเจอกับเมืองนึงเข้า");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-4", "คุณได้ช่วยหญิงสาวคนนั้นขึ้นมาจากแม่น้ำที่ไหลเชี่ยวมาพักไว้ใต้ต้นไม้ใหญ่ สักพักฝนก็หยุดตกไปเสียดื้อๆ 'คุณเห็นกระเป๋าของฉันไหม'  เธอถามคุณ");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("12-5", "คุณเลือกที่จะไม่ช่วยคนที่ลอยไปกับน้ำ เธอจมน้ำหายไปต่อหน้าต่อตาของคุณ! แต่คุณไม่สามารถทำอะไรได้แล้ว");
  //↓↓↓↓↓↓↓อาจเพิ่ม/แก้
  Game::addScene("12-6", "คุณตั้งสมาธิเพื่อที่จะรับรู้ถึงพลังงานบางอย่าง พลังงานนี้ก็กำลังมุ่งหน้าเข้ามาหาตัวคุณ! คุณรู้สึกได้ว่ามันกำลังไหลเวียนอยู่ในร่างกายของคุณมากขึ้นเรื่อยๆ อย่างมหัศจรรย์ พลังมืดของคุณเพิ่มขึ้นอย่างมหาศาล เมื่อทุกอย่างเงียบสงบคุณก็เดินออกมาจากตรงนั้น");
  Game::addScene("13-1", "คุณตัดสินใจเดินทางไปที่ป่าตะวันตก คุณต้องไปออกประตูเมืองฝั่งตะวันตกเพื่อไปที่นั่น ระหว่างทางคุณก็แวะซื้ออาหารนิดๆหน่อยๆ ติดตัวไว้ พอถึงประตูเมืองคุณก็ต้องแปลกใจเพราะมันดันปิด คุณตัดสินใจเดินไปประตูฝั่งใต้แล้วเดินย้อนกลับมาทางทิศตะวันตก เดินไปไม่นานคุณก็รับรู้ได้ว่าคุณมาถึงที่แห่งนี้แล้ว คุณเจอป่าช้าที่เต็มไปด้วยซากศพ และวิญญาณผู้ที่ตายไปแล้ว คุณตัดสินใจเดินเข้าไปใกล้แล้วก็ต้องตกใจเพราะเจอชาวบ้านหลายคนที่หายตัวไปอยู่ที่นี่");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("13-2", "เดินไปสักพักคุณรู้สึกว่าต้นไม้มีสีที่เปลี่ยนไป อาจจะเป็นต้นไม้ในอีกโซนนึงของป่า ไม่นานคุณได้ค้นพบบางอย่างคล้ายๆ สิ่งมีชีวิตมีรูปร่างสูงใหญ่แต่ไม่ใช่มนุษย์ คุณค้นพบ Elemental Guardian เขาไม่ได้เข้ามาทำร้ายคุณ แต่กลับถามคุณว่า 'เจ้าต้องการพิสูจน์ตนเองหรือไม่' ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-3(1)", "พวกทหารได้จับคุณไปขังคุก เพราะคุณด่าพวกเขา! คุณตัดสินใจที่จะ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-3(2)", "พวกทหารได้จับคุณไปขังคุก เนื่องจากคุณลักลอบเข้าเมือง คุณตัดสินใจที่จะ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-4(1)", "'คุณเห็นแล้วทำไมคุณถึงไม่เอามันขึ้นมาด้วยล่ะ!?' หญิงสาวพูดเสียงดัง");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-4(2)", "'คุณไม่เห็น หรือคุณขโมยไปกันแน่!' หญิงสาวพูดเสียงดัง");

/*
  Game::addScene("18-3", "normal version diualogue");
  Game::addScene("18-3wizard_event", "Event version dialogue");
  Game::addEvent("18-3", "18-3wizard_event");
*/

//↓proxy zone
  Game::addScene("14-1", "");
  Game::addScene("14-2", "");
  Game::addScene("14-3", "");
  Game::addScene("14-4", "");
  Game::addScene("14-5", "");
  Game::addScene("15-2", "");
//↑proxy zone

  Game::addScene("ending_you_die", "คุณได้ตัดสินใจสู้กับมันถึงแม้ว่าคุณจะบาดเจ็บสาหัส! ในตอนแรกนั้นคุณสามารถที่จะป้องกันการโจมตีของมันได้อยู่บ้าง แต่ยิ่งเวลาผ่านไปมากเท่าไหร่ คุณยิ่งหมดแรงไปมากเท่านั้น นั่นรวมไปถึงพิษของบาดแผลก่อนหน้านี้ที่ทำให้คุณไม่อาจต่อสู้ได้อย่างเต็มประสิทธิภาพ สุดท้ายแล้วคุณจึงสู้มันไม่ไหวและเสียชีวิต ไม่มีใครพบศพคุณหรือทราบถึงการตายของคุณเนื่องจากสัตว์บริเวณนั้นได้กัดกินร่างของคุณจนไม่เหลือแม้แต่กระดูก", true);
  Game::addScene("ending1", "This is ending 1", true);
  Game::addScene("ending2", "This is ending 2", true);
  Game::addScene("ending3", "This is ending 3", true);


//↓ ↓ ↓ O P T I O N      Z O N E      S T A R T          H E R E ↓ ↓ ↓

/* Add options to scenes
  Game::addOption("", {
    {"", ""},
    {"", ""}
  });
*/
  Game::addOption("begin", {
    {"ไม่เข้าไปในหอสมุดและเดินสำรวจเมืองต่อ", "11-1(2)"},
    {"เข้าไปในหอสมุด", "11-2"}
  });

  Game::addOption("4-1", {
    {"นั่งทำความเข้าใจเกี่ยวกับพลังที่เพิ่มขึ้นมา", "5-1"},
    {"เดินสำรวจบริเวณรอบทะเลสาบ", "4-1"}
  });

  Game::addOption("4-2", {
    {"สำรวจเมืองที่สาบสูญ", "5-2"},
    {"ออกจากเมือง", "6-4"}
  });

  Game::addOption("4-3", {
    {"หลบหนี", "4-2"},
    {"ต่อสู้กับมัน", "5-3"}
  });

  Game::addOption("5-1", {
    {"ไม่ใช้", "6-1"},
    {"ใข้", "6-2"}
  });

  Game::addOption("5-2", {
    {"ทำลาย", "6-2"},
    {"บูชา", "6-3"}
  });

  Game::addOption("5-3", {
    {"เดินหาเมือง", "4-2"},
    {"เดินเข้าไปในป่าต่อ", "6-4"}
  });

  Game::addOption("6-1", {
    {"ตามนกไป", "7-1(1)"},
    {"เดินตามใจอยาก", "7-2"}
  });

  Game::addOption("6-2", {
    {"สำรวจ", "7-1(2)"},
    {"ออกจากวัด", "7-2"}
  });

  Game::addOption("6-3", {
    {"สำรวจต่อ", "7-2"},
    {"ออกจากที่นี่", "6-4"}
  });

  //↓↓↓↓↓↓↓พ่อมดTrigger HERE
  Game::addOption("6-4", {
    {"เจรจา", "7-3", "18-3wizard_event"},
    {"ต่อสู้", "ending_you_die"}
  });
  //↑↑↑↑↑↑↑พ่อมดHERE

  Game::addOption("7-1(1)", {
    {"ดูดซับมันเข้ามา", "8-1(1)"},
    {"สำรวจต่อ", "8-2"}
  });

  Game::addOption("7-1(2)", {
    {"ดูดซับมันเข้ามา", "8-1"},
    {"สำรวจต่อ", "8-2"}
  });

  Game::addOption("7-2", {
    {"เดินไปข้างหน้า", "8-2"},
    {"เดินไปตามสัญชาติญาณ", "8-3"}
  });

  Game::addOption("7-3", {
    {"เดินสำรวจต่อ", "8-2"},
    {"หาที่พักสักแป๊บ", "8-3"}
  });

  Game::addOption("8-1(1)", {
    {"เดินตามนก", "9-1(1)"},
    {"เดินไปตามทาง", "10-2"}
  });

  Game::addOption("8-1(2)", {
    {"เดินตามนก", "9-1(1)"},
    {"เดินไปตามทาง", "10-2"}
  });

  Game::addOption("8-2", {
    {"ต่อสู้", "8-1(2)"},
    {"หลบหนี", "9-2"}
  });

  Game::addOption("8-3", {
    {"ไม่ซื้อ", "9-3"},
    {"ซื้อ", "9-4"}
  });

  Game::addOption("9-1(1)", {
    {"เดินเข้าเมือง", "10-1"},
    {"ไม่เข้าเมืองและไปในป่าอีกด้านหนึ่ง", "10-3"}
  });

  Game::addOption("9-1(2)", {
    {"เดินเข้าเมือง", "10-1"},
    {"ไม่เข้าเมืองและไปในป่าอีกด้านหนึ่ง", "10-3"}
  });

  Game::addOption("9-2", {
    {"ซ้าย", "9-1(2)"},
    {"ขวา", "10-2"}
  });

  Game::addOption("9-3", {
    {"ใช้มัน", "10-1"},
    {"ไม่ใช้", "10-2"}
  });

  Game::addOption("9-4", {
    {"ได้", "10-3"},
    {"ไม่ได้", "10-4"}
  });

  Game::addOption("10-1", {
    {"ไม่เข้าไปในหอสมุดและเดินสำรวจเมืองต่อ", "11-1(2)"},
    {"เข้าไปในหอสมุด", "11-2"}
  });

  Game::addOption("10-2", {
    {"เล่าข่าวช่วงนี้ให้ฟังที", "11-1(1)"},
    {"มอนสเตอร์ในป่าแถวนี้", "11-3(1)"}
  });

  Game::addOption("10-3", {
    {"ปีศาจต้นไม้", "11-3(2)"},
    {"ไม่ยุ่งเสียจะดีกว่า", "11-4"}
  });

  Game::addOption("10-4", {
    {"รีบออกไปจากที่นี่", "11-4"},
    {"ดูดซับ", "12-6"}
  });

  Game::addOption("11-1(1)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(2)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(3)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-2", {
    {"ออกมาและเผาทำลาย", "11-1(3)"},
    {"เรียนรู้", "12-6"}
  });

  Game::addOption("11-3(1)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-3(2)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-4", {
    {"ช่วย", "12-4"},
    {"ไม่ช่วย", "12-5"}
  });

  Game::addOption("12-1", {
    {"ไปที่ป่าตะวันตก", "13-1"},
    {"แจ้งทหาร", "12-2"}
  });

  Game::addOption("12-2", {
    {"ออกไปนอกเมือง", "13-2"},
    {"ด่าทอ", "13-3(1)"}
  });

  Game::addOption("12-3(1)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-3(2)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-4", {
    {"มันลอยไปกับน้ำแล้ว", "13-4(1)"},
    {"ไม่เห็นเลย", "13-4(2)"}
  });

  Game::addOption("12-5", {
    {"เข้าเมือง", "13-3(2)"},
    {"เดินเข้าไปในป่าต่อ", "13-2"}
  });

  Game::addOption("12-6", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("13-1", {
    {"ปราบภูติผีและช่วยชาวบ้าน", "14-1"},
    {"มันไม่ใช่เรื่องของฉัน", "14-2"}
  });

  Game::addOption("13-2", {
    {"ใช่", "14-3"},
    {"ไม่", "14-2"}
  });

  Game::addOption("13-3(1)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2"}
  });

  Game::addOption("13-3(2)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2"}
  });

  Game::addOption("13-4(1)", {
    {"ช่วยเธอตามหาของ", "14-4"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4"}
  });

  Game::addOption("13-4(2)", {
    {"ช่วยเธอตามหาของ", "14-4"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4"}
  });
  
/*
    Game::addOption("18-3wizard_event", {
    {"", ""},
    {"", ""}
  });
*/

  // Game loop
  Game::runGame("begin");
}
