#include "dialogueMaker/dialogueMaker.h"

int main() {
/* Create scenes
  Game::addScene("", "");
*/

  Game::addScene("prologue","ยินดีต้อนรับเข้าสู่เกมไข่ต้ม คุณจะเล่นเป็นตัวละครนักผจญภัย นามว่าไข่ต้ม ผู้ต้องการจะออกเดินทาง เพื่อทำตามสิ่งที่เขาได้รับมอบหมายมา การเลือกตัวเลือกของคุณจะทำให้โชคชะตาของไข่ต้มเปลี่ยนไปอย่างสิ้นเชิง คุณพร้อมหรือยังที่จะผจญภัยในโลกอันแสนกว้างใหญ่นี้? ");
  Game::addScene("begin","คุณตื่นขึ้นมาในโบราณสถานแห่งหนึ่ง มันเต็มไปด้วยซากปรักหักพังแต่ยังคงเค้าโครงความงามของสถานที่ไว้ได้ ในขณะที่คุณกำลังเพลิดเพลินไปกับความงามราวกับฝัน คุณกลับรู้สึกเจ็บแปลบที่แขนขึ้นมาเล็กน้อย ราวกับว่านี่มันไม่ใช่ฝัน ‘เอ๊ะ นี่ไม่ใช่ฝันอย่างนั้นนะเหรอ!’ คุณมีความรู้สึกว่าที่นี่ไม่ใช่ที่ที่คุณคุ้นเคย แต่คุณก็จำอะไรเกี่ยวกับตัวเองไม่ได้เลย นอกจากชื่อของคุณ “ไข่ต้ม” ");
  Game::addScene("1-1","เนื่องจากคุณไม่รู้จักสถานที่แห่งนี้ คุณจึงลุกขึ้นพร้อมกับเดินสำรวจไปรอบๆ สถานที่แห่งนี้สร้างขึ้นด้วยหิน เรียงสลับทับซ้อนกันอย่างสวยงาม คุณเดินไปสักพักก็ได้สังเกตเห็นหินที่ผิดแปลกออกไปจากหินก้อนอื่น ด้วยความสงสัยใคร่รู้ คุณจึงได้วางมือแตะลงไป ขณะนั้นเองเส้นทางใหม่ในโบราณสถานแห่งนี้ได้ถูกเปิดขึ้น เส้นทางนั้นเป็นลักษณะของบันไดทอดยาวลงไป คุณจึงเดินตามทางลงมาจนสุด แล้วได้พบกับโบราณวัตถุชิ้นนึง คุณตัดสินใจที่จะ ");
  Game::addScene("2-1","คุณตัดสินใจแตะโบราณวัตถุชิ้นนั้น ชั่วขณะนั้นเอง คุณสัมผัสได้ถึงบางอย่างที่แปลกไป สิ่งที่เหมือนกับพลังงานโบราณบางอย่าง ดูเหมือนว่ามันต้องการที่จะสื่อสารกับคุณ เพียงไม่นาน คุณก็สังเกตเห็นว่ามีอักษรโบราณประหลาดๆ ปรากฏ​ขึ้นบนวัตถุชิ้นนั้น ด้วยใจความว่า ‘เพื่อให้โลกนี้สงบสุข เจ้าจะต้องช่วยชาวบ้านทั้งหลายเอาไว้ให้จงได้’ ตัวอักษรได้เปลี่ยนไปอีกครั้ง แล้วจึงปรากฏว่า ‘เจ้าต้องการยอมรับคำทำนายหรือไม่’");
  Game::addScene("2-2","คุณพิจารณามันอยู่สักพัก ก็มีความรู้ที่สึกว่ามีอะไรบางอย่างกำลังคืบคลานเข้ามา คุณตัดสินใจที่จะวิ่งไปข้างหน้าโดยไม่หันกลับไปมองด้านหลัง ในขณะที่คุณกำลังวิ่งไปเรื่อยๆนั้น ดูเหมือนว่าทางที่คุณวิ่งมานั้น จะมีสภาพแวดล้อมคล้ายๆ กับถ้ำ ‘นี่คือถ้ำที่อยู่ใต้ดินอย่างงั้นเหรอ!’ คุณได้แต่ครุ่นคิด ด้วยความกลัวปนกังวล คุณจึงวิ่งไปอย่างไม่รู้จุดหมาย เมื่อคุณรู้ตัวอีกทีก็หยุดอยู่ที่ข้างหน้าประตูยักษ์บานหนึ่ง เมื่อมองไปรอบๆ ก็ไม่เห็นทางอื่นที่คุณสามารถไปได้แล้ว คุณจึงตัดสินใจผลักประตูบานนั้นเข้าไป สิ่งที่อยู่ตรงหน้าคุณทำให้คุณถึงกับตกตะลึง! และอ้าปากค้าง จากนั้นคุณได้ค้นพบวิญญาณศักดิ์สิทธิ์ตนหนึ่งซึ่งกำลังเคลื่อนที่มาทางนี้");
  Game::addScene("3-1","คุณสัมผัสได้ถึงสิ่งที่เหมือนกับพลังงานโบราณก่อนหน้านี้กำลังโอบล้อมรอบตัว และหายเข้าไปในร่างของคุณ แต่แล้วสายตาของคุณก็เหลือบไปเห็นแสงดวงหนึ่งลอยไปลอยมา และอยู่ดีๆ มันกำลังพุ่งตรงมาที่คุณ! แสงดวงนั้นชนเข้ากับคุณอย่างจัง ทำให้แสงสว่างวาบจนคุณต้องหลับตาลง เมื่อคุณรู้ตัวอีกทีคุณก็ถูกวาร์ปมายังสถานที่แห่งหนึ่ง ที่นี่เต็มไปด้วยดอกไม้นานาพันธุ์ ต้นไม้เขียวขจี และมีทะเลสาบขนาดใหญ่อยู่ที่แห่งนี้ด้วย คุณตกตะลึงไปกับภาพที่เห็น มันสวยงามมาก คุณตัดสินใจเดินเข้าไปใกล้ทะเลสาบ");
  Game::addScene("3-2(1)","คุณได้ตัดสินใจที่จะปฏิเสธคำทำนาย คุณรู้สึกได้ว่าบรรยากาศรอบด้านนั้นแปลกไป อากาศรอบด้านเริ่มอบอุ่นขึ้นเรื่อยๆ มันให้ความรู้สึกเหมือนมีเตาผิงอยู่ในนี้ก็ไม่ปาน ทันใดนั้นเองก็มีแสงบางอย่างวิ่งเข้ามาชนตัวคุณอย่างจัง แสงนั่นมันทำให้คุณถูกวาร์ปไปยังสถานที่แห่งหนึ่ง ที่ที่เต็มไปด้วยต้นไม้ที่มีเถาวัลย์พันเกี่ยวไปมาอย่างยุ่งเหยิง รูปร่างของมันทั้งน่าเกลียดน่ากลัวและยั๊วะเยี๊ยะเต็มไปหมด นอกจากนี้คุณได้ยินเสียงสัตว์ดุร้ายนานาพันธ์ุดังออกมาเป็นระยะๆ ");
  Game::addScene("3-2(2)","คุณได้ทำการพูดคุยต่อรองกับวิญญาณ​ตนนั้น แต่เนื่องจากคุณไม่มีประสบการณ์ด้านนี้มากนัก จึงทำให้คุณต่อรองไม่สำเร็จ ไม่ทันที่คุณจะได้พูดจนจบประโยค คุณก็รู้สึกได้ว่าสติของคุณกำลังเลือนหายไปอย่างน่าประหลาดใจ เมื่อคุณตื่นขึ้นมาอีกครั้ง และได้พบกับความจริงว่าคุณได้ถูกส่งตัวมายังสถานที่อื่นเสียแล้ว เมื่อคุณมองไปรอบด้าน คุณเห็นว่าสถานที่นี้เต็มไปด้วยต้นไม้ที่มีเถาวัลย์พันเกี่ยวไปมาอย่างยุ่งเหยิง พลางได้ยินเสียงสัตว์ดุร้ายออกมาเป็นระยะๆ");
//  Game::addScene("3-2[2]","");

  Game::addScene("begin", "คุณเดินผ่านซุ้มประตูใหญ่เข้ามาในเมือง เพียงคุณเดินเข้ามาก็มีหลากหลายสายตาจับจ้อง แต่การมาถึงของนักเดินทางรวมถึงนักผจญภัยในเมืองนี้ไม่ค่อยเป็นอันตรายสักเท่าไหร่ เพราะนักเดินทางส่วนใหญ่ล้วนมาที่เมืองแห่งนี้เพื่อแลกเปลี่ยนสินค้า เดินไปกลางเมืองใหญ่คุณพบกับที่ที่หนึ่งถูกล้อมปิดไว้ไม่ให้ใครเข้า มันเป็นสถานที่เก็บหนังสือ แต่ยิ่งห้ามก็เหมือนยิ่งยุจึงมีคนหลายคนพยายามที่จะแหกกฏเข้าไป ด้วยความสงสัยคุณเลยถามผู้คนแถวนั้นได้ความว่าที่แห่งนี้เป็นหอสมุดต้องห้าม คุณเดินออกมาจากฝูงชนแถวนั้นและจากนั้นคุณเลือกที่จะ");
  Game::addScene("10-1", "คุณเดินผ่านซุ้มประตูใหญ่เข้ามาในเมือง เพียงคุณเดินเข้ามาก็มีหลากหลายสายตาจับจ้อง แต่การมาถึงของนักเดินทางรวมถึงนักผจญภัยในเมืองนี้ไม่ค่อยเป็นอันตรายสักเท่าไหร่ เพราะนักเดินทางส่วนใหญ่ล้วนมาที่เมืองแห่งนี้เพื่อแลกเปลี่ยนสินค้า เดินไปกลางเมืองใหญ่คุณพบกับที่ที่หนึ่งถูกล้อมปิดไว้ไม่ให้ใครเข้า มันเป็นสถานที่เก็บหนังสือ แต่ยิ่งห้ามก็เหมือนยิ่งยุจึงมีคนหลายคนพยายามที่จะแหกกฏเข้าไป ด้วยความสงสัยคุณเลยถามผู้คนแถวนั้นได้ความว่าที่แห่งนี้เป็นหอสมุดต้องห้าม คุณเดินออกมาจากฝูงชนแถวนั้นและจากนั้นคุณเลือกที่จะ");
  Game::addScene("10-2", "เดินไปสักพักท้องฟ้าจากที่เคยสว่างนั้นเริ่มมืดลง เวลาตอนนี้กำลังคลืบืบคลานเข้าสู่ช่วงเย็น คุณจำเป็นต้องหาที่เพื่อพักผ่อนก่อนลุยต่อ ไม่นานคุณก็พบกับที่ที่คุณคิดว่าจะพักในคืนนี้ได้แล้ว มันเป็นทุ่งหญ้าขนาดใหญ่ไร้ซึ่งผู้คนมีแต่ความเงียบเหงา ในขณะที่คุณกำลังจะพักผ่อนนั้นได้มีนักเดินทางผ่านมาพร้อมทั้งกล่าวว่า “ขอผมพักที่นี่กับคุณด้วยได้ไหม” คุณตอบตกลง แล้วเขาได้โพล่งขึ้นมาว่า “ขอบใจมาก ถ้าอย่างนั้นคุณต้องการอะไรเป็นการตอบแทนหรือ");
  Game::addScene("10-3", "คุณเดินเลาะกำแพงเมืองออกมา มุ่งหน้าเดินไปในป่าใหญ่ ไม่นานคุณก็พบกับร่องรอยของสัตว์ป่าเป็นทางยาว คุณเลยตัดสินใจตามรอยนั้นไป และได้พบกับรอยคราบเลือด ที่เหมือนจะโดนลากไปบนต้นไม้ ‘คราบเลือดบนต้นไม้? ต้นไม้นี่แปลกจริงๆ’ คุณคิดอย่างสงสัย");
  Game::addScene("10-4", "คุณตัดสินใจทอดทิ้งพวกเขา และปฏิเสธที่จะให้ความช่วยเหลือกับพวกชาวบ้าน คุณเดินออกห่างจากหมู่บ้านนั้นได้ไม่นาน คุณก็รู้สึกได้ว่าพลังมืดแถวนี้รุนแรงมากจนคุณสัมผัสถึงมันได้ ระหว่างที่คุณเดินไปนั้น คุณได้แต่คิดไม่ตกว่าจะเอาอย่างไรต่อดี คุณจะทำอย่างไรต่อ");
  Game::addScene("11-1(1)", "เมืองใหญ่เมืองนึงไม่ไกลจากนี้มากนัก หลายวันมานี้มีข่าวการหายไปของคนในชุมชนเป็นว่าเล่น นับว่าเป็นข่าวใหญ่เลยก็ได้เพราะขนาดผมยังไม่ได้ไปที่เมืองแห่งนั้น ผมยังได้ยินข่าวนี้มาเป็นรอบที่ 2 ของวันเลยด้วย” เขาเล่าให้คุณฟังอย่างที่คุณขอ คุณคิดเกี่ยวกับเหตุการณ์ที่เกิดขึ้น");
  //↓↓↓↓↓↓↓รอแก้
  Game::addScene("11-1(2)", "คุณได้ตัดสินใจที่จะไม่เข้าไปในหอสมุดประหลาดนี้และเลือกที่จะเดินเข้าไปในตัวเมืองแทน ในขณะที่คุณกำลังเดินสำรวจภายในเมืองไปสักพักก็ไปเจอกับตลาด ที่ที่แลกเปลี่ยนขายของกันที่นี่ คุณเดินเข้าไปข้างในด้วยความที่อยากรู้ว่ามีอะไรน่าสนใจบ้าง เดินไปเดินมาคุณได้ยินพวกชาวบ้านยืนคุยกันว่า คนหลายคนในชุมชนนี้หายตัวไปอย่างปริศนา");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-1(3)", "คุณนำมันออกมาเผาในที่ลับตาผู้คน กว่าจะเผาหมดคุณใช้เวลานานพอสมควร จากนั้นคุณเดินกลับเข้าไปในเมือง และได้ยินพวกชาวบ้านยืนคุยกันว่า คนหลายคนในชุมชนนี้หายตัวไปอย่างปริศนา");
  Game::addScene("11-2", "ภายในที่แห่งนี้เต็มไปด้วยชั้นวางหนังสือที่เรียงกันทอดยาวไปสุดสายตา คุณเลือกที่จะเดินเข้าไปที่ซอกหนึ่งของชั้นหนังสือ และได้พบว่าเป็นหนังสือเกี่ยวกับมนต์ดำ คุณเดินสำรวจอีกหลายๆ ที่ของหอสมุด ก็ล้วนพบว่ามีแต่หนังสือที่เกี่ยวกับมนต์ดำเต็มไปหมด");
  Game::addScene("11-3(1)", "แถวนี้นั้นเต็มไปด้วยสัตว์ประหลาดมากมาย คุณอาจได้ยินเสียงพวกมันบ่อยๆ ดังออกมาจากป่าใหญ่ จากที่ผมเคยเจอและต่อสู้กับพวกมันบางตัว มันมีหลากหลายชนิดหลากหลายสายพันธุ์นับไม่ถ้วน และผมคาดว่าพวกมันอาจจะกระจายตัวทั่วทั้งป่าเลยล่ะ” เขาบอก รุ่งขึ้นคุณและเขาแยกทางกัน คุณเดินเข้าไปในป่าอีกที่นึง คุณเดินไปสักพักก็สังเกตเห็นต้นไม้ต้นนึง พลันสั่นไหวและมันหันมาที่คุณ ‘มันดูอันตราย’");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-3(2)", "ไม่นานคุณก็ได้ยินเสียงแปลกๆ มาจากต้นไม้ต้นนั้น คุณเลยเดินเข้าไปใกล้ขึ้นเรื่อยๆ จนคุณก็สังเกตเห็นว่าต้นไม้ต้นนั้นพลันสั่นไหวและมันหันมาที่คุณ ‘มันดูอันตราย’ คุณคิด");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("11-4", "คุณเดินออกมาจากตรงนั้นแล้วเดินไปทางอื่นต่อ สักพักท้องฟ้าก็เริ่มมืดครึ้ม ฝนกำลังตั้งเค้า ก้อนเมฆกลายเป็นสีเทาเหมือนฝนที่พร้อมจะตกตลอดเวลา ไม่นานฝนก็เริ่มตกหนัก คุณเดินไปหลบฝนใต้ต้นไม้ใกล้ๆ กับแม่น้ำ แต่เหมือนว่าฝนจะตกหนักจนแม่น้ำเชี่ยวกราก คุณกำลังจะเดินออกไปจากบริเวณนั้นแต่แล้วก็ได้ยินเสียงขอความช่วยเหลือดังมาจากในแม่น้ำ เหมือนว่าเธอคนนั้นจะพลัดตกลงไป");
  //↓↓↓↓↓↓↓ ต้ อ ง เ พิ่ ม
  Game::addScene("12-1", "คุณตัดสินใจที่จะสืบเรื่องราวนี้ต่อ จากการพบเจอชาวบ้านและผู้คนในบริเวณนี้นั้น ทำให้คุณรู้ข้อมูลว่าผู้คนมักจะหายไปในตอนกลางคืนทางด้านป่าตะวันตก");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-2", "คุณเลือกที่จะไปแจ้งทหารที่อยู่ในเมือง แต่คุณก็ต้องแปลกใจที่ทหารเหล่านั้นกลับทำเฉยกับเรื่องราวเหล่านี้ ราวกับว่าไม่มีอะไรเกิดขึ้น คุณรู้สึกหัวเสียเป็นอย่างมากเลยเลือกที่จะ");
  Game::addScene("12-3(1)", "คุณเดินเข้าไปเกือบถึงตัวมัน ต้นไม้นั่นเริ่มโจมตีคุณโดยไม่ทันได้ตั้งตัว คุณสวนกลับไปอย่างไม่มีใครยอมใคร ในสุดท้ายแล้วคุณก็สามารถจัดการกับต้นไม้ปีศาจนั่นได้ เมื่อคุณเดินไปเจอเหล่าชาวบ้านกลุ่มหนึ่งที่อาศัยอยู่บริเวณนี้ พวกเขาเหล่านั้นได้ทราบเรื่องก็ต่างดีใจกันมาก และอวยพรให้คุณพร้อมกับให้เงินกับคุณจำนวนหนึ่ง คุณขอบคุณพวกเขาและออกเดินทางต่อ");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-3(2)", "คุณเลือกที่จะหนีจากต้นไม้นั่นออกมา และไม่ต้องทิ้งชีวิตไว้ที่นี่ คุณเดินไปเรื่อยๆ ก็ไปเจอกับเมืองนึงเข้า");
  //↓↓↓↓↓↓↓ต้ อ ง เ พิ่ ม
  Game::addScene("12-4", "คุณได้ช่วยหญิงสาวคนนั้นขึ้นมาจากแม่น้ำที่ไหลเชี่ยวมาพักไว้ใต้ต้นไม้ใหญ่ สักพักฝนก็หยุดตกไปเสียดื้อๆ 'คุณเห็นกระเป๋าของฉันไหม'  เธอถามคุณ");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("12-5", "คุณเลือกที่จะไม่ช่วยคนที่ลอยไปกับน้ำ เธอจมน้ำหายไปต่อหน้าต่อตาของคุณ! แต่คุณไม่สามารถทำอะไรได้แล้ว");
  //↓↓↓↓↓↓↓อาจเพิ่ม/แก้
  Game::addScene("12-6", "คุณตั้งสมาธิเพื่อที่จะรับรู้ถึงพลังงานบางอย่าง พลังงานนี้ก็กำลังมุ่งหน้าเข้ามาหาตัวคุณ! คุณรู้สึกได้ว่ามันกำลังไหลเวียนอยู่ในร่างกายของคุณมากขึ้นเรื่อยๆ อย่างมหัศจรรย์ พลังมืดของคุณเพิ่มขึ้นอย่างมหาศาล เมื่อทุกอย่างเงียบสงบคุณก็เดินออกมาจากตรงนั้น");
  Game::addScene("13-1", "คุณตัดสินใจเดินทางไปที่ป่าตะวันตก คุณต้องไปออกประตูเมืองฝั่งตะวันตกเพื่อไปที่นั่น ระหว่างทางคุณก็แวะซื้ออาหารนิดๆหน่อยๆ ติดตัวไว้ พอถึงประตูเมืองคุณก็ต้องแปลกใจเพราะมันดันปิด คุณตัดสินใจเดินไปประตูฝั่งใต้แล้วเดินย้อนกลับมาทางทิศตะวันตก เดินไปไม่นานคุณก็รับรู้ได้ว่าคุณมาถึงที่แห่งนี้แล้ว คุณเจอป่าช้าที่เต็มไปด้วยซากศพ และวิญญาณผู้ที่ตายไปแล้ว คุณตัดสินใจเดินเข้าไปใกล้แล้วก็ต้องตกใจเพราะเจอชาวบ้านหลายคนที่หายตัวไปอยู่ที่นี่");
  //↓↓↓↓↓↓↓อาจเพิ่ม
  Game::addScene("13-2", "เดินไปสักพักคุณรู้สึกว่าต้นไม้มีสีที่เปลี่ยนไป อาจจะเป็นต้นไม้ในอีกโซนนึงของป่า ไม่นานคุณได้ค้นพบบางอย่างคล้ายๆ สิ่งมีชีวิตมีรูปร่างสูงใหญ่แต่ไม่ใช่มนุษย์ คุณค้นพบ Elemental Guardian เขาไม่ได้เข้ามาทำร้ายคุณ แต่กลับถามคุณว่า 'เจ้าต้องการพิสูจน์ตนเองหรือไม่' ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-3(1)", "พวกทหารได้จับคุณไปขังคุก เพราะคุณด่าพวกเขา! คุณตัดสินใจที่จะ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-3(2)", "พวกทหารได้จับคุณไปขังคุก เนื่องจากคุณลักลอบเข้าเมือง คุณตัดสินใจที่จะ");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-4(1)", "'คุณเห็นแล้วทำไมคุณถึงไม่เอามันขึ้นมาด้วยล่ะ!?' หญิงสาวพูดเสียงดัง");
  //↓↓↓↓↓↓↓ต้ อ ง เพิ่ม
  Game::addScene("13-4(2)", "'คุณไม่เห็น หรือคุณขโมยไปกันแน่!' หญิงสาวพูดเสียงดัง");

//↓proxy zone
  Game::addScene("14-1", "");
  Game::addScene("14-2", "");
  Game::addScene("14-3", "");
  Game::addScene("14-4", "");
  Game::addScene("14-5", "");
  Game::addScene("15-2", "");
//↑proxy zone


  Game::addScene("ending1", "This is ending 1", true);
  Game::addScene("ending2", "This is ending 2", true);
  Game::addScene("ending3", "This is ending 3", true);


//↓ ↓ ↓ O P T I O N      Z O N E      S T A R T          H E R E ↓ ↓ ↓

/* Add options to scenes
  Game::addOption("", {
    {"", ""},
    {"", ""}
  });
*/

// Add options to scenes
  Game::addOption("prologue", {
    {"พิมพ์เลข 1 เพื่อเริ่มเกม", "begin"}
  });

  Game::addOption("begin", { 
    {"พิมพ์เลข 1 เพื่อดำเนินเรื่อง", "1-1"}
  });

  Game::addOption("1-1", {
    {"แตะที่โบราณวัตถุ", "2-1"},
    {"สังเกตอย่างละเอียดอย่างเดียว", "2-2"}
  });

  Game::addOption("2-1", {
    {"ยอมรับคำทำนาย", "3-1"}, 
    {"ปฏิเสธคำทำนาย", "3-2(1)"}
  });

  Game::addOption("2-2", {
    {"เผชิญหน้ากับ วิญญาณ", "2-1"}, 
    {"ต่อรองกับวิญญาณ", "3-2(2)"}
  });

  Game::addOption("3-1",{
    {"ดื่มน้ำจากทะเลสาบ","4-1"},
    {"เดินสำรวจรอบบริเวณทะเลสาบ","4-2"}
  });

  Game::addOption("3-2(1)",{
    {"เดินสำรวจลึกเข้าไปในป่า","4-2"},
    {"ถอย และทบทวนว่าจะเอาอย่างไรต่อ","4-3"}
  });

  Game::addOption("3-2(2)",{
    {"เดินสำรวจลึกเข้าไปในป่า","4-2"},
    {"ถอย และทบทวนว่าจะเอาอย่างไรต่อ","4-3"}
  });

//  Game::addOption("3-2",{
//     {},
//     {}
//   });


  Game::addOption("begin", {
    {"ไม่เข้าไปในหอสมุดและเดินสำรวจเมืองต่อ", "11-1(2)"},
    {"เข้าไปในหอสมุด", "11-2"}
  });

  Game::addOption("10-1", {
    {"ไม่เข้าไปในหอสมุดและเดินสำรวจเมืองต่อ", "11-1(2)"},
    {"เข้าไปในหอสมุด", "11-2"}
  });

  Game::addOption("10-2", {
    {"เล่าข่าวช่วงนี้ให้ฟังที", "11-1(1)"},
    {"มอนสเตอร์ในป่าแถวนี้", "11-3(1)"}
  });

  Game::addOption("10-3", {
    {"ปีศาจต้นไม้", "11-3(2)"},
    {"ไม่ยุ่งเสียจะดีกว่า", "11-4"}
  });

  Game::addOption("10-4", {
    {"รีบออกไปจากที่นี่", "11-4"},
    {"ดูดซับ", "12-6"}
  });

  Game::addOption("11-1(1)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(2)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-1(3)", {
    {"สืบเรื่องราว", "12-1"},
    {"ไม่ล่ะ ไม่ยุ่งดีกว่า", "12-2"}
  });

  Game::addOption("11-2", {
    {"ออกมาและเผาทำลาย", "11-1(3)"},
    {"เรียนรู้", "12-6"}
  });

  Game::addOption("11-3(1)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-3(2)", {
    {"จัดการมัน", "12-3(1)"},
    {"หนี", "12-3(2)"}
  });

  Game::addOption("11-4", {
    {"ช่วย", "12-4"},
    {"ไม่ช่วย", "12-5"}
  });

  Game::addOption("12-1", {
    {"ไปที่ป่าตะวันตก", "13-1"},
    {"แจ้งทหาร", "12-2"}
  });

  Game::addOption("12-2", {
    {"ออกไปนอกเมือง", "13-2"},
    {"ด่าทอ", "13-3(1)"}
  });

  Game::addOption("12-3(1)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-3(2)", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("12-4", {
    {"มันลอยไปกับน้ำแล้ว", "13-4(1)"},
    {"ไม่เห็นเลย", "13-4(2)"}
  });

  Game::addOption("12-5", {
    {"เข้าเมือง", "13-3(2)"},
    {"เดินเข้าไปในป่าต่อ", "13-2"}
  });

  Game::addOption("12-6", {
    {"เข้าป่า", "13-2"},
    {"เข้าเมือง", "13-3(2)"}
  });

  Game::addOption("13-1", {
    {"ปราบภูติผีและช่วยชาวบ้าน", "14-1"},
    {"มันไม่ใช่เรื่องของฉัน", "14-2"}
  });

  Game::addOption("13-2", {
    {"ใช่", "14-3"},
    {"ไม่", "14-2"}
  });

  Game::addOption("13-3(1)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2"}
  });

  Game::addOption("13-3(2)", {
    {"ขึ้นศาล", "14-5"},
    {"ติดสินบน", "15-2"}
  });

  Game::addOption("13-4(1)", {
    {"ช่วยเธอตามหาของ", "14-4"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4"}
  });

  Game::addOption("13-4(2)", {
    {"ช่วยเธอตามหาของ", "14-4"},
    {"ไม่เห็นจะเกี่ยวกับฉันเลย (ไม่ช่วย)", "14-4"}
  });
  
  // Game loop
  Game::runGame("begin");
}
